<template>
  <div>
    // todo все хуйня давай по новій # Калібрування E-steps екструдера ## Для
    bowden екструдера Відкрутіть тефлонову трубочку від екструдера [фото]
    Вставляємо філамент, відрізаємо рівненько щоб не торяав з екструдера [фото]
    Перед тим як давити філамент потрібно або розігріти хот-енд або вимкнути
    перевірку температури за допомогою gcode (для Marlin) ```gcode M302 P1 ```
    Це потрібно тому що принтер не дозволить давити пруток на холодну.
    Видавлюємо 100-300мм прутка, чим більше тим вище буде точність, але більше
    300 на мою думку немає сенсу, як і менше 100. Видавити можна через екран
    (можливо навіть вдастця видавити на холодну, може запитати чи дійсно
    видавити без нагріву) або видавити через gcode. E - кількість в
    міліметрах<br />
    F - швидкість в міліметрах на хвилину ```gcode M83 G1 E100 F100 M82 ```
    Відрізаємо шматок який видавився так само під рівень екструдеру як відрізали
    перед цим. Міряємо і запамятовуємо скільки видавилось по факту. Заходимо
    через екран в налаштування принтеру, шукаємо параметр E-Steps. Підставляємо
    наші данні в формулу ([або користуємось онлайн калькулятором](todo)) ``` N =
    C * E / D ``` Де:<br />
    N - Нове значення E-Steps<br />
    D - Скільки міліметрів прутка видавилось<br />
    E - Поточне значення E-Steps<br />
    C - Скільки міліметрів прутка видавлювали Вводимо розраховане значення та
    зберігаємо в EPROMM Якщо вимикали перевірку температури через gcode то не
    забудьте увімкнути назад ```gcode M302 P0 ``` ## Для direct екструдера
    Розігрійте хот-енд, витягніть філамент, зніміть сопло, перевірте щоб в
    хот-енді не було пластику (його там в принципі не має бути але всеж)
    Дочекайтесь поки хот-енд повністью охолоне!!! при нагрітому хот-енді пластик
    буде деформуватись/розтягуватись і така "калібровка" зробить тільки гірше.
    Перед тим як давити філамент потрібно вимкнути перевірку температури за
    допомогою gcode (для Marlin) ```gcode M302 P1 ``` Це потрібно тому що
    принтер не дозволить давити пруток на холодну. Заправляємо філамент,
    видавлюємо щоб почав вилазити з хот-енду, обрізаємо щоб не виходив з
    хот-енду. Видавлюємо 100-300мм прутка, чим більше тим вище буде точність але
    більше 300 на мою думку немає сенсу, як і менше 100. Видавити можна через
    екран (можливо навіть вдастця видавити на холодну, може запитати чи дійсно
    видавити без нагріву) або видавити через gcode. E - кількість в
    міліметрах<br />
    F - швидкість в міліметрах на хвилину ```gcode M83 G1 E100 F100 M82 ```
    Відрізаємо шматок який видавився так само під рівень хот-енду як відрізали
    перед цим. Міряємо і запамятовуємо скільки видавилось по факту. Заходимо
    через екран в налаштування принтеру, шукаємо параметр E-Steps. Підставляємо
    наші данні в формулу ([або користуємось онлайн калькулятором](todo)) ``` N =
    C * E / D ``` Де:<br />
    N - Нове значення E-Steps<br />
    D - Скільки міліметрів прутка видавилось<br />
    E - Поточне значення E-Steps<br />
    C - Скільки міліметрів прутка видавлювали Вводимо розраховане значення та
    зберігаємо в EPROMM Якщо вимикали перевірку температури через gcode то не
    забудьте увімкнути назад ```gcode M302 P0 ```
  </div>
</template>

<script>
export default {
  name: "e-steps",
};
</script>
